tsung/deposit_and_buy_flow.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='1000'/>
  </clients>
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url="/user.json"
              method="POST"
              content_type="application/json"
              contents_from_file="./exchanges_body.json"
        />
      </request>
      <request>
        <http url="/exchanges.json"
              method="POST"
              content_type="application/json"
              contents_from_file="./exchanges_body.json"
        />
      </request>
      <thinktime value="2" random="true"/>
      <request>
        <http url="/transactions.json"
              method="POST"
              content_type='application/json'
              contents_from_file="./transaction_body.json"
        />
      </request>
    </session>
  </sessions>

</tsung>