tsung/load_test_login.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [
        <!ENTITY login_post_session SYSTEM "tsung_recorder20180717.xml">
        ]>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='1000'/>
  </clients>
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>
  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
  <request>
    <http url="/sessions" content_type = 'application/json' method="POST" 
    contents_from_file="./login_info.json" >
    </http>
  </request>
  <request>
    <http url="/transactions" content_type = 'application/json' method="POST" 
    contents_from_file="./transaction_buy.json">
    </http>
  </request>

  <request>
    <http url="/transactions" content_type = 'application/json' method="POST" 
    contents_from_file="./transaction_sell.json">
    </http>
  </request>
    </session>
  </sessions>

</tsung>